Revit 2027 API
IFCLevelInfo Class
 Represents information about a particular level in the document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCLevelInfo
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCLevelInfo : IDisposable
Public Class IFCLevelInfo
	Implements IDisposable
public ref class IFCLevelInfo : IDisposable
type IFCLevelInfo =
    class
        interface IDisposable
    end
The IFCLevelInfo type exposes the following members.
Properties
Name | Description
DistanceToNextLevel |  The distance to the next story level.
Elevation |  The elevation of the level.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Create |  Creates an IFCLevelInfo.
Dispose | Releases all resources used by the IFCLevelInfo
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBuildingStorey |  Gets the IfcBuildingStorey handle.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLocalPlacement |  Gets the local placement.
GetRelatedElements |  Gets all building elements on this level.
GetRelatedProducts |  Gets all building products on this level.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 Level information includes the height, which is the distance to from this level to the next available level, and the actual elevation of the level, in the Revit default units.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace